app/controllers/projects_controller.rb

INSERT INTO "projects" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "meow"], ["description", "meow\n"], ["created_at", "2022-11-20 04:48:56.713878"], ["updated_at", "2022-11-20 04:48:56.713878"]]
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save

UPDATE "projects" SET "updated_at" = ?, "image" = ? WHERE "projects"."id" = ?  [["updated_at", "2023-01-02 00:59:17.734413"], ["image", "https://www.inmagine.com/wp-content/uploads/2019/12/stock_content.jpg"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @project.update(project_params)